2019/java-time.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-04-20 周六 11:16 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Java8 时间处理</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/blog/misc/style.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Java8 时间处理</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0315286">1. 前言</a></li>
<li><a href="#orgf89ed72">2. 时间单位和时区</a></li>
<li><a href="#orge1508d7">3. 时间点</a></li>
<li><a href="#org5b680cc">4. 时间段</a></li>
<li><a href="#org92edb35">5. 时间的解析和格式化</a></li>
<li><a href="#orge3b9c9a">6. 时区时间</a></li>
<li><a href="#org5e7e513">7. 兼容旧接口</a></li>
<li><a href="#org7c8f46a">8. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0315286" class="outline-2">
<h2 id="org0315286"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
时间处理是一个经常会用到但又不那么好用的功能，其中的主要问题在于对人友好的时间格式的处理上。
</p>

<p>
在这一点上，Java8 提供了方便我们的使用的新的日期和时间接口。
</p>

<details><summary><i>……</i></summary>

<p>
当然了，Java8 出来都这么久了，这接口也不算新了 @_@
</p>

</details>
</div>
</div>

<div id="outline-container-orgf89ed72" class="outline-2">
<h2 id="orgf89ed72"><span class="section-number-2">2</span> 时间单位和时区</h2>
<div class="outline-text-2" id="text-2">
<p>
时间是我们每天都在接触的东西，但我并不是很清楚和它的相关的一些概念，借着这次机会，去了解了时间处理中常用的两个概念：时间单位和时区。
</p>

<p>
首先是时间单位，通过 <a href="https://en.wikipedia.org/wiki/Unit_of_time">维基百科</a> 可以发现时间单位有很多，在 Java 中是通过枚举 <a href="https://docs.oracle.com/javase/8/docs/api/java/time/temporal/ChronoUnit.html">ChronoUnit</a> 来表示时间单位的，这里列出其中常用的一部分：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">时间单位</th>
<th scope="col" class="org-left">大小</th>
<th scope="col" class="org-left">java.time.temporal.ChronoUnit</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">纳秒</td>
<td class="org-left">10^-9 s</td>
<td class="org-left">ChronoUnit.NANOS</td>
</tr>

<tr>
<td class="org-left">毫秒</td>
<td class="org-left">10^-3 s</td>
<td class="org-left">ChronoUnit.MILLIS</td>
</tr>

<tr>
<td class="org-left">秒</td>
<td class="org-left">1 s</td>
<td class="org-left">ChronoUnit.SECONDS</td>
</tr>

<tr>
<td class="org-left">分</td>
<td class="org-left">60 s</td>
<td class="org-left">ChronoUnit.MINUTES</td>
</tr>

<tr>
<td class="org-left">时</td>
<td class="org-left">3600 s</td>
<td class="org-left">ChronoUnit.HOURS</td>
</tr>

<tr>
<td class="org-left">日</td>
<td class="org-left">24 时</td>
<td class="org-left">ChronoUnit.DAYS</td>
</tr>

<tr>
<td class="org-left">周</td>
<td class="org-left">7 日</td>
<td class="org-left">ChronoUnit.WEEKS</td>
</tr>

<tr>
<td class="org-left">月</td>
<td class="org-left">28-31 日</td>
<td class="org-left">ChronoUnit.MONTHS</td>
</tr>

<tr>
<td class="org-left">年</td>
<td class="org-left">12 月</td>
<td class="org-left">ChronoUnit.YEARS</td>
</tr>
</tbody>
</table>

<p>
然后是时区这个有些复杂的概念，时区的理解需要区分 <b>本地时间</b> 和 <b>UTC 偏移量</b>.
</p>

<p>
比如说时间 <code>2019-04-19T14:31:09.764+08:00[Asia/Shanghai]</code>, 这个时间表示 <code>Asia/Shanghai</code> 时区的 <b>本地时间</b> 为 <code>2019-04-19T14:31:09.764</code>, 
而它的 <b>UTC 偏移量</b> 为 <code>+08:00</code>, 即：时区 Asia/Shanghai 的的本地时间比世界标准时间（本初子午线处的本地时间）快 8 个小时。
</p>

<p>
在计算两个时区之间的时间差时，不能直接用本地时间进行计算，而应该综合本地时间和 UTC 偏移量。
</p>

<p>
最直接的方式便是将两个时区的时间都转换为 UTC 世界标准时间然后在进行计算。
</p>
</div>
</div>

<div id="outline-container-orge1508d7" class="outline-2">
<h2 id="orge1508d7"><span class="section-number-2">3</span> 时间点</h2>
<div class="outline-text-2" id="text-3">
<p>
对时间的处理可以粗略的划分为三个部分：时间点、时间段和时间的解析与格式化。
</p>

<p>
在 Java8 中表示时间点的对象都实现了接口 <a href="https://docs.oracle.com/javase/8/docs/api/java/time/temporal/Temporal.html">java.time.temporal</a>，其中，常用的时间点对象有：Instant、LocalDate、LocalTime 和 LocalDateTime。
</p>

<p>
这几个时间点对象中比较特殊的是 <code>Instant</code> 对象，这个对象表示的时间是世界标准时间，而不是本地时间。
</p>

<p>
尝试执行下面这一行代码你就会发现，它的输出结果和你电脑上显示的时间是不一样的，如果是在国内，那么它的结果会比你电脑上的时间慢 8 个小时：
</p>
<div class="org-src-container">
<pre class="src src-java">System.out.println(Instant.<span class="org-type">now</span>());
</pre>
</div>

<p>
这些时间点对象都提供了可以根据当前时间创建相应时间点对象的静态工厂方法 <code>now</code>, 除了 <code>Instant</code> 以外也提供了静态工厂方法 <code>of</code> 允许你指定参数创建时间点对象：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-type">LocalDate</span> <span class="org-variable-name">date</span> = LocalDate.of(2019, 4, 19);                  <span class="org-comment-delimiter">// </span><span class="org-comment">2019-04-15</span>
<span class="org-type">LocalTime</span> <span class="org-variable-name">time</span> = LocalTime.of(15, 0, 0);                     <span class="org-comment-delimiter">// </span><span class="org-comment">15:00:00</span>
<span class="org-type">LocalDateTime</span> <span class="org-variable-name">dt</span> = LocalDateTime.of(2019, 4, 19, 15, 0, 0);  <span class="org-comment-delimiter">// </span><span class="org-comment">2019-04-15 15:00:00</span>
</pre>
</div>

<p>
和旧的接口不一样的一点是，这些对象都是 <b>不可变</b> 对象，这意味着修改这些对象的属性时会返回创建的新对象。
</p>

<p>
修改这些对象的方法有很多，通用的便是在 <code>Temporal</code> 接口中定义的一些方法：
</p>
<div class="org-src-container">
<pre class="src src-java">minus(<span class="org-type">long</span> <span class="org-variable-name">amountToSubtract</span>, <span class="org-type">TemporalUnit</span> <span class="org-variable-name">unit</span>);  <span class="org-comment-delimiter">// </span><span class="org-comment">- amountToSubtract * unit</span>
minus(<span class="org-type">TemporalAmount</span> <span class="org-variable-name">amount</span>);                     <span class="org-comment-delimiter">// </span><span class="org-comment">- amount</span>

plus(<span class="org-type">long</span> <span class="org-variable-name">amountToAdd</span>, <span class="org-type">TemporalUnit</span> <span class="org-variable-name">unit</span>);        <span class="org-comment-delimiter">// </span><span class="org-comment">+ amountToSubtract * unit</span>
plus(<span class="org-type">TemporalAmount</span> <span class="org-variable-name">amount</span>);                      <span class="org-comment-delimiter">// </span><span class="org-comment">+ amount</span>

with(<span class="org-type">TemporalAdjuster</span> <span class="org-variable-name">adjuster</span>);
with(<span class="org-type">TemporalField</span> <span class="org-variable-name">field</span>, <span class="org-type">long</span> <span class="org-variable-name">newValue</span>);
</pre>
</div>

<p>
当然了，这些对象也提供了更多的方便使用的接口，可以很方便的在相应的时间单位上进行修改。
</p>

<p>
这里比较特殊的是通过 <code>TemporalAdjuster</code> 对时间进行调整，它的伴随类 <code>TemporalAdjusters</code> 提供了一些现成的工厂方法，方便我们使用：
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">&#23558;&#26085;&#26399;&#35843;&#25972;&#21040;&#35813;&#26376;&#30340;&#26368;&#21518;&#19968;&#22825;</span>
LocalDate.now().with(TemporalAdjusters.lastDayOfMonth());
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b680cc" class="outline-2">
<h2 id="org5b680cc"><span class="section-number-2">4</span> 时间段</h2>
<div class="outline-text-2" id="text-4">
<p>
时间段对应的接口是 <a href="https://docs.oracle.com/javase/8/docs/api/java/time/temporal/TemporalAmount.html">java.time.temporal</a>，这个接口的实现只有两个：Duration 和 Period。
</p>

<p>
Duration 可以通过两个 LocalDateTime、LocalTime 和 Instant 对象创建：
</p>
<div class="org-src-container">
<pre class="src src-java">Duration.between(<span class="org-type">time1</span>, <span class="org-type">time2</span>);
</pre>
</div>

<p>
而 Period 对象可以通过两个 LocalDate 对象进行创建：
</p>
<div class="org-src-container">
<pre class="src src-java">Period.between(<span class="org-type">date1</span>, <span class="org-type">date2</span>);
</pre>
</div>

<p>
除了通过两个时间点对象以外，Duration 和 Period 对象也提供了一些静态工厂方法创建实例：
</p>
<div class="org-src-container">
<pre class="src src-java">Duration.of(3, <span class="org-constant">ChronoUnit</span>.<span class="org-type">MILLIS</span>);  <span class="org-comment-delimiter">// </span><span class="org-comment">3 Millis</span>
Period.of(0, 0, 1);                 <span class="org-comment-delimiter">// </span><span class="org-comment">1 day</span>
</pre>
</div>

<p>
Duration 和 Period 对象都提供了相应的 get 方法用于获取它们支持的时间单位的长度（好像是病句 QAQ）：
</p>
<div class="org-src-container">
<pre class="src src-java">Duration.ofDays(1).getSeconds();  <span class="org-comment-delimiter">// </span><span class="org-comment">86400</span>
Period.of(1, 2, 3).getDays();     <span class="org-comment-delimiter">// </span><span class="org-comment">3</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org92edb35" class="outline-2">
<h2 id="org92edb35"><span class="section-number-2">5</span> 时间的解析和格式化</h2>
<div class="outline-text-2" id="text-5">
<p>
时间的解析和格式化相关的对象是 <code>DateTimeFormatter</code>, 这个类提供了很多默认的格式器，也可以自己创建格式器。
</p>

<p>
时间点对象都可以通过静态方法 <code>parse</code> 解析字符串创建实例，除了 Instant 对象以外还支持提供一个 DateTimeFormatter 参数解析特定格式的时间字符串：
</p>
<div class="org-src-container">
<pre class="src src-java">Instant.parse(<span class="org-warning">'</span>2007-12-03T10:15:30.00Z<span class="org-warning">'</span>)
LocalDateTime.parse(<span class="org-warning">'</span>2017-12-3T09:32:00<span class="org-warning">'</span>, <span class="org-constant">DateTimeFormatter</span>.ISO_LOCAL_DATE_TIME)
</pre>
</div>

<p>
虽然 <code>DateTimeFormatter</code> 提供了很多的默认格式器，但是这些格式器有时并不能满足我们的需求，这时可以通过自定义格式器完成相关的时间解析工作：
</p>
<div class="org-src-container">
<pre class="src src-java">LocalDateTime.parse(<span class="org-warning">'</span>17-12-03 09:32:00<span class="org-warning">'</span>, DateTimeFormatter.ofPattern(<span class="org-string">"yy-MM-dd HH:mm:ss"</span>))
</pre>
</div>

<p>
下面是常用的日期/时间格式的格式化符号：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">时间与或目的</th>
<th scope="col" class="org-left">示例</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">YEAR</td>
<td class="org-left">yy: 69, yyyy: 1969</td>
</tr>

<tr>
<td class="org-left">MONTH</td>
<td class="org-left">M: 7, MM: 07, MMM: Jul, MMMM: July, MMMMM:  J</td>
</tr>

<tr>
<td class="org-left">DAY</td>
<td class="org-left">d: 6, dd: 06</td>
</tr>

<tr>
<td class="org-left">WEEK</td>
<td class="org-left">e: 3, E: Wed, EEE: Wednesday, EEEE: W</td>
</tr>

<tr>
<td class="org-left">HOUR</td>
<td class="org-left">H: 9, HH: 09</td>
</tr>

<tr>
<td class="org-left">MINUTE</td>
<td class="org-left">mm: 02</td>
</tr>

<tr>
<td class="org-left">SECOND</td>
<td class="org-left">ss: 00</td>
</tr>
</tbody>
</table>

<p>
时间字符串反过来便是时间的格式化了，我们可以通过格式器来格式化时间：
</p>
<div class="org-src-container">
<pre class="src src-java">DateTimeFormatter.ofPattern(<span class="org-string">"yy-MM-dd HH:mm:ss"</span>).format(LocalDateTime.now());  <span class="org-comment-delimiter">// </span><span class="org-comment">19-04-19 20:53:49</span>
<span class="org-constant">DateTimeFormatter</span>.BASIC_ISO_DATE.format(LocalDateTime.now());                  <span class="org-comment-delimiter">// </span><span class="org-comment">20190419</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3b9c9a" class="outline-2">
<h2 id="orge3b9c9a"><span class="section-number-2">6</span> 时区时间</h2>
<div class="outline-text-2" id="text-6">
<p>
时区时间同样也是时间点对象，实现了 <code>Temporal</code> 接口，相较于 <code>LocalDateTime</code>, 时区时间多了 <b>时区信息</b>:
</p>
<pre class="example">
ZonedDateTime: 2019-04-20T10:14:44.396+08:00[Asia/Shanghai]
LocalDateTime: 2019-04-20T10:14:44.396
LocalDate:     2019-04-20
LocalTime:     14:44.396
</pre>

<p>
时区信息可以通过 <code>ZoneId</code> 标识，LocalDateTime 对象可以通过 <code>ZoneId</code> 对象添加时区信息（不会修改本地时间的值）：
</p>
<div class="org-src-container">
<pre class="src src-java">LocalDateTime.now().atZone(ZoneId.of(<span class="org-warning">'</span>Europe/London<span class="org-warning">'</span>));  <span class="org-comment-delimiter">// </span><span class="org-comment">2019-04-20T10:19:30.461+01:00[Europe/London]</span>
</pre>
</div>

<p>
如果不想直接用时区 ID，那么可以选择使用 UTC 时间偏差：
</p>
<div class="org-src-container">
<pre class="src src-java">LocalDateTime.now().atOffset(ZoneOffset.of(<span class="org-string">"+01:00"</span>));  <span class="org-comment-delimiter">// </span><span class="org-comment">2019-04-20T10:25:14.496+01:00</span>
</pre>
</div>

<p>
而且使用 <code>ZoneOffset</code> 可以转换 LocalDateTime 和 Instant：
</p>
<div class="org-src-container">
<pre class="src src-java">LocalDateTime.now().toInstant(ZoneOffset.of(<span class="org-string">"+01:00"</span>));           <span class="org-comment-delimiter">// </span><span class="org-comment">2019-04-20T09:34:59.110Z</span>
LocalDateTime.ofInstant(Instant.now(), ZoneOffset.of(<span class="org-string">"+01:00"</span>));  <span class="org-comment-delimiter">// </span><span class="org-comment">2019-04-20T03:35:51.980</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e7e513" class="outline-2">
<h2 id="org5e7e513"><span class="section-number-2">7</span> 兼容旧接口</h2>
<div class="outline-text-2" id="text-7">
<p>
Java8 提供了一些方法允许新的日期时间后旧的日期时间进行转换，下面列举出了一部分：
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">类</th>
<th scope="col" class="org-left">转换到旧的对象</th>
<th scope="col" class="org-left">转换到新的对象</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Instant - java.util.Date</td>
<td class="org-left">Date.from(instant)</td>
<td class="org-left">date.toInstant()</td>
</tr>

<tr>
<td class="org-left">LocalDate - java.sql.Date</td>
<td class="org-left">Date.valueOf(localDate)</td>
<td class="org-left">date.toLocalDate()</td>
</tr>

<tr>
<td class="org-left">LocalTime - java.sql.Time</td>
<td class="org-left">Time.valueOf(localTime)</td>
<td class="org-left">date.toLocalTime()</td>
</tr>

<tr>
<td class="org-left">ZoneId - java.util.TimeZone</td>
<td class="org-left">TimeZone.getTimeZone(id)</td>
<td class="org-left">timeZone.toZoneId()</td>
</tr>
</tbody>
</table>

<p>
可以说，Java 8 不仅提供了新的接口，还提供了能够很方便的兼容旧的接口的方式，真的很棒！
</p>
</div>
</div>

<div id="outline-container-org7c8f46a" class="outline-2">
<h2 id="org7c8f46a"><span class="section-number-2">8</span> 结语</h2>
<div class="outline-text-2" id="text-8">
<p>
这篇博客的内容不怎么详细，基本上只是简单的提了一下各个接口可以做什么，更多的使用还是需要翻文档。
</p>

<p>
但是不得不说，Java8 的日期和时间接口提供了很多方便我们使用的功能，而且接口的设计也很 Beautiful！
</p>

<p>
Nice!!!
</p>

<details><summary><i>……</i></summary>

<p>
这篇博客的编写主要参考了两本书：《Java8 实战》和《Java 核心技术卷卷二》。
</p>

<p>
然后就不得不吐槽《Java8 实战》这本书了，关于时间处理的这一章节勘误一大堆，内容也不是很清楚。
</p>

<p>
而《Java 核心技术卷卷二》就写的很清楚，不知道是不是翻译的锅……
</p>

</details>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明：本作品采用<a rel="license" href="http://creativecommons.org/licenses/by-nc/4.0/">知识共享署名-非商业性使用 4.0 国际许可协议</a>进行许可
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
